In [42]:
import pandas as pd

In [3]:
pd.__version__

'2.2.2'

In [4]:
data = pd.read_csv('dataset.csv')

In [5]:
data

    fname     lname   age   gender
0  davood    rajaee    23     male
1    sara   hashemi    18   female

In [36]:
animals = ['Tiger', 'Bear', 'Lion']
pdAnimals = pd.Series(animals)
pdAnimals

0    Tiger
1     Bear
2     Lion
dtype: object

In [11]:
type(pdAnimals)

pandas.core.series.Series

In [15]:
pdAnimals[1]

'Bear'

In [40]:
 animals = {
     'n1' : 'Tiger',
     'n2' : 'Bear',
     'n3' : 'Lion'
 }
pAnimals = pd.Series(animals)
pAnimals

n1    Tiger
n2     Bear
n3     Lion
dtype: object

In [23]:
pAnimals.index

Index(['n1', 'n2', 'n3'], dtype='object')

In [24]:
pAnimals.values

array(['Tiger', 'Bear', None], dtype=object)

In [25]:
pAnimals['n1']

'Tiger'

In [26]:
pAnimals.loc['n1']

'Tiger'

In [27]:
pAnimals.iloc[0]

'Tiger'

In [32]:
for item in pAnimals:
    print('salam ' + str(item))

salam Tiger
salam Bear
salam None

In [33]:
import numpy as np

In [34]:
num = [2 , 20, 5]
pNum = pd.Series(num)
np.sum(pNum)

27

In [44]:
for index, item in pdAnimals.items():
    print('Salam ' + str(item) + '... index is ' + str(index))

Salam Tiger... index is 0
Salam Bear... index is 1
Salam Lion... index is 2

In [49]:
ani1 = {
    'a1' : 'tiger1',
    'a2' : 'lion1',
    'a3' : 'cat1'
}
ps1 = pd.Series(ani1)
ani2 = {
    'a1' : 'tiger2',
    'a2' : 'lion2',
    'a3' : 'cat2'
}
ps2 = pd.Series(ani2)
ani3 = {
    'a1' : 'tiger3',
    'a2' : 'lion2',
    'a3' : 'cat3'
}
ps3 = pd.Series(ani3)

df = pd.DataFrame([ps1, ps2, ps3])
df

       a1     a2    a3
0  tiger1  lion1  cat1
1  tiger2  lion2  cat2
2  tiger3  lion2  cat3

In [53]:
df.loc[0].loc['a2']

'lion1'

In [67]:
ani1 = {
    'a1' : 'tiger1',
    'a2' : 'lion1',
    'a3' : 'cat1'
}
ps1 = pd.Series(ani1)
ani2 = {
    'a1' : 'tiger2',
    'a2' : 'lion2',
    'a3' : 'cat2'
}
ps2 = pd.Series(ani2)
ani3 = {
    'a1' : 'tiger3',
    'a2' : 'lion2',
    'a3' : 'cat3'
}
ps3 = pd.Series(ani3)

df = pd.DataFrame([ps1, ps2, ps3], index=['n1', 'n2', 'n3'])
df

        a1     a2    a3
n1  tiger1  lion1  cat1
n2  tiger2  lion2  cat2
n3  tiger3  lion2  cat3

In [68]:
df.loc['n1'].loc['a2']

'lion1'

In [69]:
df.loc['n1', 'a2']

'lion1'

In [71]:
df.loc[['n1', 'n2']]

        a1     a2    a3
n1  tiger1  lion1  cat1
n2  tiger2  lion2  cat2

In [73]:
df.loc[['n1', 'n2'], 'a2']

n1    lion1
n2    lion2
Name: a2, dtype: object

In [74]:
df.loc[:, ['a1', 'a2']]

        a1     a2
n1  tiger1  lion1
n2  tiger2  lion2
n3  tiger3  lion2

In [76]:
df2 = df.drop('n2')
df2

        a1     a2    a3
n1  tiger1  lion1  cat1
n3  tiger3  lion2  cat3

In [77]:
df

        a1     a2    a3
n1  tiger1  lion1  cat1
n2  tiger2  lion2  cat2
n3  tiger3  lion2  cat3

In [78]:
df.drop('n2', inplace=True)

In [79]:
df

        a1     a2    a3
n1  tiger1  lion1  cat1
n3  tiger3  lion2  cat3